artilleryTestGet.yaml
config:
  target: http://localhost:3000
  ensure:
    p95: 1000
  phases:
  - duration: 100
    arrivalRate: 1
    name: Warm up phase
  - duration : 300
    arrivalRate: 10
    rampTo: 100
    maxVusers: 30
    name: 10 users per second
  - duration : 300
    arrivalRate: 100
    maxVusers: 100
    name: 100 users per second
  payload:
      path: "gameIds.csv"
      fields:
        - "gameId"
scenarios:
  - flow:
      - get:
          url: "/app/{{gameId}}"